Locked-Inc/STAR/star-rx72n-firmware/src/tasks/imu_task.c
/**
 * @file imu_task.c
 * @brief IMU Task - BNO055 + BMP280 Interrupt-Driven Sensor Reading
 *
 * @details
 * # Overview
 *
 * This module implements the IMU Task that initializes and polls the
 * BNO055 9-DOF absolute orientation sensor and the BMP280 barometric
 * pressure sensor at 20 Hz (50 ms period), publishing results to
 * shared data for consumption by the telemetry task.
 *
 * # Hardware
 *
 * Both sensors use RIIC1 I2C hardware (P2.0=SDA1, P2.1=SCL1):
 * - **BNO055**: I2C addr 0x28, bus "i2c1_imu", NDOF fusion mode (heading, quaternion, linear accel)
 * - **BMP280**: I2C addr 0x76, bus "i2c1_baro", forced mode (pressure Pa, temperature cC)
 *
 * # Task Lifecycle
 *
 * @startuml
 * [*] --> Init
 * Init --> Running : both sensors initialized
 * Init --> Running : one or both sensors failed (logs error, continues)
 * Running --> Running : BNO055 INT (IRQ12) fires -> ISR sets event flag -> read BNO055 + BMP280
 * Running --> Running : 200 ms watchdog timeout -> read without INT (fault recovery)
 * @enduml
 *
 * # Data Flow
 *
 * @code{.unparsed}
 * imu_task
 *    |----> rx_bno055_read() -> imu_state_t -> shared_data_update_imu()
 *    |----> rx_bmp280_read() -> baro_state_t -> shared_data_update_baro()
 * @endcode
 *
 * # Thread Safety
 *
 * All shared data writes go through mutex-protected accessor functions.
 * The task does not directly access g_shared_data members.
 *
 * # NASA Power of 10 Compliance
 *
 * | Rule | Status | Notes |
 * |------|--------|-------|
 * | 1. No goto | [PASS] | Structured if/while only |
 * | 2. Bounded loops | [PASS] | while(true) with IWDT watchdog |
 * | 3. No dynamic memory | [PASS] | Static stack and thread control block |
 * | 4. Short functions | [PASS] | Task entry ~60 lines; helpers extracted |
 * | 5. Assertions | [PASS] | 2+ preconditions per function |
 * | 6. Data scope | [PASS] | Locals at point of use |
 * | 7. Check returns | [PASS] | All driver and shared_data returns validated |
 * | 8. Limit preprocessor | [PASS] | C23 typed enums only |
 * | 9. Pointer restrictions | [WARN] | Function pointers for DIP (bus manager) |
 * | 10. Compile warnings | [PASS] | -Wall -Wextra -Werror |
 *
 * @see imu_task.h Public API
 * @see rx_bno055.h BNO055 driver
 * @see rx_bmp280.h BMP280 driver
 * @see shared_data.h Shared state types and accessor functions
 *
 * @author STAR Team
 * @date 2026-03-04
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 */

#include "imu_task.h"

#include "hardware.h"
#include "rx_bmp280.h"
#include "rx_bno055.h"
#include "rx_check.h"
#include "rx_iwdt.h"
#include "rx_log.h"
#include "rx_port_constants.h"
#include "shared_data.h"
#include "tx_api.h"
#ifdef __RX__
#include "rx72n_icu_regs.h"
#endif /* __RX__ */

/* =============================================================================
 * Constants
 * =============================================================================
 */

/**
 * @enum imu_task_stack_cfg_t
 * @brief IMU task stack size constant
 *
 * @details
 * Defines the stack size in bytes for the IMU task. Uses uint16_t because
 * 2048 exceeds the uint8_t maximum of 255.
 *
 * **Stack rationale:**
 * - 2048 bytes: BNO055 init sequence writes ~12 registers (local buffers)
 * - BMP280 init reads 24-byte calib block (local buffer)
 * - State structs imu_state_t (~32 bytes) + baro_state_t (~16 bytes)
 *
 * @invariant k_imu_task_stack_size > 0 (stack must be non-zero)
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_imu_task_stack_size = 2048, /**< Stack size in bytes (exceeds uint8_t range) */
} imu_task_stack_cfg_t;

/**
 * @enum imu_task_cfg_t
 * @brief IMU task thread entry input constant
 *
 * @details
 * Defines the thread entry ULONG input for the IMU task (currently unused).
 * Priority is defined in imu_task.h as k_imu_task_priority (= 13).
 * Period ticks are defined in imu_task.h as k_imu_task_period_ticks (= 5).
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_imu_task_input = 0U, /**< Thread entry ULONG input (unused) */
} imu_task_cfg_t;

/**
 * @enum imu_task_time_t
 * @brief Milliseconds-per-second constant for tick-to-millisecond conversion
 *
 * @details
 * Used to convert ThreadX tick counts from tx_time_get() to milliseconds:
 * timestamp_ms = ticks * k_imu_ms_per_second / TX_TIMER_TICKS_PER_SECOND
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_imu_ms_per_second = 1000U, /**< Milliseconds per second (conversion factor for tick->ms) */
} imu_task_time_t;

/**
 * @enum imu_task_hw_rst_ms_t
 * @brief BNO055 hardware reset minimum durations in milliseconds (from datasheet)
 *
 * @details
 * Source values in milliseconds for the two delays in the BNO055 hardware
 * reset sequence, used to compute the tick counts in imu_task_hw_rst_t.
 *
 * | Constant                  | Value | Source |
 * |---------------------------|-------|--------|
 * | k_imu_hw_rst_assert_ms    | 10    | BNO055 datasheet: RST active-low min hold |
 * | k_imu_hw_rst_por_ms       | 650   | BNO055 datasheet: POR completion time |
 *
 * @see imu_task_hw_rst_t Derived tick counts (with +1 slack per tick)
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_imu_hw_rst_assert_ms = 10U,  /**< Min RST assert duration: 10 ms per BNO055 datasheet */
  k_imu_hw_rst_por_ms    = 650U, /**< Min POR completion wait: 650 ms per BNO055 datasheet */
} imu_task_hw_rst_ms_t;

/**
 * @enum imu_task_hw_rst_t
 * @brief BNO055 hardware reset timing constants in ThreadX ticks (P83/IMU RST, active-low)
 *
 * @details
 * Defines the ThreadX tick counts for the two delays in the BNO055 hardware
 * reset sequence performed via P83 (IMU RST, active-low, pin 58).
 *
 * tx_thread_sleep() may complete up to one full tick early, so each value adds
 * one extra tick of slack using the formula:
 *   ticks = ceil(ms * TX_TIMER_TICKS_PER_SECOND / 1000) + 1
 *         = (ms * TX_TIMER_TICKS_PER_SECOND + 999) / 1000 + 1
 *
 * At TX_TIMER_TICKS_PER_SECOND = 100 Hz:
 * | Constant                  | Formula result | Guaranteed minimum |
 * |---------------------------|----------------|--------------------|
 * | k_imu_hw_rst_assert_ticks | 2 ticks        | 10 ms              |
 * | k_imu_hw_rst_por_ticks    | 66 ticks       | 650 ms             |
 *
 * @invariant k_imu_hw_rst_assert_ticks >= 2 (ceil(10 ms / tick) + 1 slack)
 * @invariant k_imu_hw_rst_por_ticks >= 66 (ceil(650 ms / tick) + 1 slack)
 *
 * @see imu_task_hw_rst_ms_t Source millisecond values
 * @see internal_imu_hardware_reset() Consumer of these constants
 * @see hardware_config.h k_imu_rst_port, k_imu_rst_pin for P83 pin assignment
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  /** @brief RST assert duration: ceil(10 ms * 100 Hz / 1000) + 1 = 2 ticks */
  k_imu_hw_rst_assert_ticks =
    (k_imu_hw_rst_assert_ms * TX_TIMER_TICKS_PER_SECOND + 999U) / 1000U + 1U,
  /** @brief POR wait after deassert: ceil(650 ms * 100 Hz / 1000) + 1 = 66 ticks */
  k_imu_hw_rst_por_ticks = (k_imu_hw_rst_por_ms * TX_TIMER_TICKS_PER_SECOND + 999U) / 1000U + 1U,
} imu_task_hw_rst_t;

/**
 * @enum imu_task_int_cfg_t
 * @brief IMU INT watchdog timeout constants (interrupt-driven mode)
 *
 * @details
 * The IMU task blocks on s_imu_event_flags waiting for the BNO055 INT
 * falling-edge ISR to signal k_imu_event_data_ready. If no INT fires
 * within k_imu_int_timeout_ticks, the task reads BNO055 anyway (fault
 * recovery) and logs a warning.
 *
 * Timeout formula (with +1 slack for tick boundary):
 *   ticks = (ms * TX_TIMER_TICKS_PER_SECOND + 999) / 1000 + 1
 * At 100 Hz: (200 * 100 + 999) / 1000 + 1 = 20999/1000 + 1 = 21 ticks.
 *
 * @invariant k_imu_int_timeout_ticks >= 21 at 100 Hz tick rate
 * @see s_imu_event_flags ThreadX event flags group
 * @see k_imu_event_data_ready Event bit set by ISR
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_imu_int_timeout_ticks =
    ((uint8_t)k_imu_int_timeout_ms * TX_TIMER_TICKS_PER_SECOND + 999U) / 1000U +
    1U, /**< Timeout in ticks with +1 slack: (200*100+999)/1000+1 = 21 ticks */
  k_imu_event_data_ready = 0x01U, /**< Event flag bit set by ISR on BNO055 INT assertion */
} imu_task_int_cfg_t;

#ifdef __RX__
/**
 * @enum imu_isr_constants_t
 * @brief ICU constants for the IMU INT ISR (RX target only)
 *
 * @details
 * Mirrors k_imu_irq_vector and k_icu_ir_clear_imu from hardware_init.c for use
 * in the INT_IRQ12 ISR, which cannot include hardware_init.h (no public header).
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_imu_irq_vector_isr = 76U, /**< ICU vector for IRQ12: matches hardware_init.c */
  k_icu_ir_clear_val   = 0U,  /**< Write 0 to IR register to clear pending flag */
} imu_isr_constants_t;
#endif /* __RX__ */

static_assert(TX_TIMER_TICKS_PER_SECOND != 0U, "TX_TIMER_TICKS_PER_SECOND must be non-zero");
static_assert(k_imu_ms_per_second > 0U, "k_imu_ms_per_second must be positive");
static_assert(((uint32_t)k_imu_task_period_ms * (uint32_t)TX_TIMER_TICKS_PER_SECOND) %
                  (uint32_t)k_imu_ms_per_second ==
                0U,
              "IMU period must map to a whole number of ThreadX ticks");
static_assert(
  (uint32_t)k_imu_task_period_ticks ==
    (((uint32_t)k_imu_task_period_ms * (uint32_t)TX_TIMER_TICKS_PER_SECOND) /
     (uint32_t)k_imu_ms_per_second),
  "k_imu_task_period_ticks must match k_imu_task_period_ms / TX_TIMER_TICKS_PER_SECOND");

