Locked-Inc/STAR/star-rx72n-firmware/src/tasks/imu_task.c
/* =============================================================================
 * Static State
 * =============================================================================
 */

/**
 * @brief ThreadX thread control block for the IMU task
 * @details Holds the OS-level thread state (stack pointer, priority, etc.).
 *          Allocated statically; never freed (NASA Rule 3).
 * @invariant Valid after imu_task_create() returns k_rx_ok
 * @since Version 1.0.0
 */
static TX_THREAD s_imu_thread;

/**
 * @brief Static thread stack for the IMU task (zero dynamic allocation)
 * @details Provides the execution stack for internal_imu_task_entry().
 *          Size = k_imu_task_stack_size (2048 bytes) is sufficient for
 *          BNO055 init, BMP280 init, and periodic read buffers.
 * @invariant Length == k_imu_task_stack_size; never modified after creation
 * @since Version 1.0.0
 */
static uint8_t s_imu_stack[k_imu_task_stack_size];

/**
 * @brief Task creation guard: prevents double creation of the IMU task
 * @details Set to true by imu_task_create() after ThreadX thread creation
 *          succeeds. Checked at entry to detect and reject duplicate calls.
 * @invariant false before first imu_task_create() call; true after success
 * @since Version 1.0.0
 */
static bool s_imu_created = false;

/**
 * @brief Log tag for this module
 * @details Constant string used as the tag parameter in all rx_log_* calls.
 * @invariant Points to static string "IMU"; never NULL, never modified
 * @since Version 1.0.0
 */
static const char* const s_tag = "IMU";

/**
 * @var s_task_name
 * @brief ThreadX task name for ImuTask
 *
 * @details
 * Task name string passed to tx_thread_create() and rx_iwdt_task_heartbeat().
 * Centralising the name in one place avoids typos across tx_thread_create()
 * and the IWDT heartbeat call site.
 *
 * @invariant Content is always "ImuTask"; never NULL, never modified at runtime
 * @note Not thread-safe; used as a read-only constant
 * @warning Do not modify; used as an identifier by the IWDT subsystem
 *
 * @see imu_task_create() Passes s_task_name to tx_thread_create()
 * @see internal_send_iwdt_heartbeat() Passes s_task_name to rx_iwdt_task_heartbeat()
 *
 * @since Version 1.0.0
 */
static char s_task_name[] = "ImuTask"; /* char[] (not const) satisfies ThreadX CHAR* parameter */

/**
 * @var s_imu_event_flags
 * @brief ThreadX event flags group for BNO055 INT signaling
 *
 * @details
 * Set by INT_IRQ12 (ISR context) on each falling edge of the BNO055 INT pin
 * (P3.2 / IRQ12). The IMU task blocks on this group with a
 * k_imu_int_timeout_ticks watchdog timeout.
 *
 * @note Initialized in imu_task_create() via tx_event_flags_create().
 * @warning Access only via tx_event_flags_get() and tx_event_flags_set().
 * @since Version 1.0.0
 */
static TX_EVENT_FLAGS_GROUP s_imu_event_flags;

/**
 * @var g_bus_manager
 * @brief External bus manager defined in shared_data.c; registered buses include "i2c1_imu" and "i2c1_baro"
 *
 * @details
 * Declared extern here because main.h does not export g_bus_manager.
 * If a main.h public header is added, replace this with #include "main.h".
 * The IMU task uses this to pass the bus manager to rx_bno055_init() and
 * rx_bmp280_init() during task startup.
 *
 * @note Using inline extern is necessary because shared_data.h does not export g_bus_manager.
 *       If a shared_data.h public accessor is added, replace this with the accessor.
 *
 * @since Version 1.0.0
 */
extern rx_bus_manager_t
  g_bus_manager; /* TODO(#373): add main.h public header to replace inline extern */

/* =============================================================================
 * Forward Declarations
 * =============================================================================
 */

static void     internal_send_iwdt_heartbeat(void);
static void     internal_retry_sensor_init(bool* bno_ready, bool* bmp_ready);
static void     internal_read_and_publish_imu(void);
static void     internal_read_and_publish_baro(void);
static rx_err_t internal_imu_hardware_reset(void);
static void     internal_imu_task_entry(ULONG input);

/* =============================================================================
 * Static Inline Helpers
 * =============================================================================
 */

/**
 * @brief Convert current ThreadX tick count to milliseconds
 *
 * @details
 * Reads the ThreadX system tick counter and converts to wall-clock milliseconds.
 * Both imu_state_t.timestamp_ms and baro_state_t.timestamp_ms use this helper
 * to ensure consistent timestamp computation from a single expression.
 *
 * @return uint32_t Current time in milliseconds since boot
 *
 * @pre ThreadX scheduler running (tx_time_get() returns valid tick count)
 * @pre TX_TIMER_TICKS_PER_SECOND > 0 (ThreadX timer configured, verified by module static_assert)
 * @post Return value is monotonically non-decreasing modulo uint32_t overflow
 * @post Return value in milliseconds: fits uint32_t for ~49 days uptime at 100 Hz tick rate
 *
 * @note Not thread-safe, but tx_time_get() is interrupt-safe on RX72N
 * @since Version 1.0.0
 */
static inline uint32_t internal_ticks_to_ms(void)
{
  return (uint32_t)((uint64_t)tx_time_get() * k_imu_ms_per_second / TX_TIMER_TICKS_PER_SECOND);
}

/* =============================================================================
 * Public Functions
 * =============================================================================
 */

/**
 * @brief Create and start the IMU sensor task
 *
 * @details
 * Creates the ImuTask ThreadX task with priority 13, 2048-byte stack,
 * and auto-start. Returns k_rx_err_invalid_state on double creation.
 *
 * @return rx_err_t Task creation result
 * @retval k_rx_ok Task created and scheduled
 * @retval k_rx_err_invalid_state Called a second time (task already created)
 * @retval k_rx_err_rtos_thread_create ThreadX thread creation failed
 *
 * @pre ThreadX kernel running (tx_application_define context)
 * @pre s_imu_created == false (first call)
 * @post s_imu_created == true
 * @post ImuTask scheduled for execution at priority 13
 *
 * @note Not thread-safe; call from single-threaded tx_application_define() only
 * @note Sensor initialization occurs inside the task (not in this function)
 *
 * @see imu_task.h Header declaration
 * @see internal_imu_task_entry() Task body
 *
 * @since Version 1.0.0
 */
rx_err_t imu_task_create(void)
{
  RX_ASSERT(k_imu_task_stack_size > 0U, "IMU stack size must be non-zero");
  if (s_imu_created) {
    return k_rx_err_invalid_state;
  }

