Locked-Inc/STAR/star-rx72n-firmware/src/tasks/imu_task.c
  /* Feed watchdog before the long startup sequence (~1.37 s total) so the IWDT
   * registration window is refreshed and the system does not reset during init. */
  internal_send_iwdt_heartbeat();

  /* Step 1: Hardware reset BNO055 via P83 (IMU RST, active-low) to guarantee clean state.
   * Asserts RST LOW for >= 10 ms then releases; waits >= 650 ms for POR to complete. */
  bool           bno_ready = false;
  const rx_err_t err_rst   = internal_imu_hardware_reset();
  if (err_rst != k_rx_ok) {
    rx_log_error_val(s_tag, "BNO055 HW reset failed - will skip init", (uint32_t)err_rst);
  }

  /* Feed watchdog after the hardware reset block (~670 ms) before BNO055 software
   * init (~700 ms) to prevent IWDT expiry during the combined ~1.37 s startup. */
  internal_send_iwdt_heartbeat();

  /* Step 2: Initialize BNO055 (software reset + config, blocks ~700 ms) */
  if (err_rst == k_rx_ok) {
    const rx_err_t err_bno = rx_bno055_init(&g_bus_manager);
    if (err_bno != k_rx_ok) {
      rx_log_error_val(s_tag, "BNO055 init failed - will retry in loop", (uint32_t)err_bno);
    } else {
      bno_ready = true;
      rx_log_info(s_tag, "BNO055 initialized in NDOF mode");
    }
  }

  /* Feed watchdog after BNO055 init before BMP280 init */
  internal_send_iwdt_heartbeat();

  /* Step 3: Initialize BMP280 (~2 ms for calibration burst read) */
  bool           bmp_ready = false;
  const rx_err_t err_bmp   = rx_bmp280_init(&g_bus_manager);
  if (err_bmp != k_rx_ok) {
    rx_log_error_val(s_tag, "BMP280 init failed - will retry in loop", (uint32_t)err_bmp);
  } else {
    bmp_ready = true;
    rx_log_info(s_tag, "BMP280 initialized in forced mode");
  }

  /* Step 4: Interrupt-driven loop - block on BNO055 INT event flag */
  rx_log_info(s_tag, "IMU interrupt-driven mode: blocking on IRQ12 event flag");
  while (1) {
    /* Feed IWDT heartbeat first -- must arrive within 900 ms window */
    internal_send_iwdt_heartbeat();

    /* Block until BNO055 asserts INT (falling edge) or 200 ms timeout */
    ULONG      actual_flags = 0U;
    const UINT ef_status    = tx_event_flags_get(&s_imu_event_flags,
                                              (ULONG)k_imu_event_data_ready,
                                              TX_OR_CLEAR,
                                              &actual_flags,
                                              (ULONG)k_imu_int_timeout_ticks);

    if (ef_status != TX_SUCCESS) {
      /* Timeout: BNO055 INT did not fire within 200 ms -- read anyway (fault recovery) */
      rx_log_warn(s_tag, "IMU INT timeout (200 ms) - reading without INT");
    }

    /* Retry init for sensors that failed initial startup */
    internal_retry_sensor_init(&bno_ready, &bmp_ready);

    if (bno_ready) {
      internal_read_and_publish_imu();
    }
    if (bmp_ready) {
      internal_read_and_publish_baro();
    }
  }
}
